In [315]:
import pandas as pd

In [316]:
# Ramka danych utw. ze s≈Çownika
df = pd.DataFrame({"A":np.round(np.random.uniform(0, 1, 5), 2),\
"B":np.random.choice(["a", "b", "c"], 5),\
"C":np.random.choice([True, False], 5, True, [0.4, 0.6])})

In [317]:
df.A.values # wartosci ramki df z kolumnyt o nazwie A

array([0.8 , 0.31, 0.18, 0.08, 0.93])

In [318]:
df.index  # etykiety wierszy

RangeIndex(start=0, stop=5, step=1)

In [319]:
df.columns # etykiety kolumn

Index(['A', 'B', 'C'], dtype='object')

In [320]:
df.columns = ["An","Bn","Cn"]      # zmiana etykiet kolumn
df = df.set_index(np.arange(10,15,1))  # zmiana etykiet wierszy
df.index.name = "Wiersze"           # dodanie nazwy wierszy
df.columns.name = "Kolumny"         # dodanie nazwy kolumn

In [321]:
df

Kolumny    An Bn     Cn
Wiersze
10       0.80  b   True
11       0.31  b  False
12       0.18  c  False
13       0.08  b  False
14       0.93  b  False

In [322]:
df.describe()

Kolumny        An
count    5.000000
mean     0.460000
std      0.381379
min      0.080000
25%      0.180000
50%      0.310000
75%      0.800000
max      0.930000

In [323]:
df.iloc[2,1] = np.NAN; df

Kolumny    An   Bn     Cn
Wiersze
10       0.80    b   True
11       0.31    b  False
12       0.18  NaN  False
13       0.08    b  False
14       0.93    b  False

In [324]:
df = df.dropna();df
# df.fillna(value=10) # przypisanie innej warto≈õci
# df.fillna(method="ffill") # przypisanie poprzedniej warto≈õci

Kolumny    An Bn     Cn
Wiersze
10       0.80  b   True
11       0.31  b  False
13       0.08  b  False
14       0.93  b  False

In [325]:
df.insert(1, "New", (4, np.NaN, 5, np.NaN)); df # dodanie kolumny

Kolumny    An  New Bn     Cn
Wiersze
10       0.80  4.0  b   True
11       0.31  NaN  b  False
13       0.08  5.0  b  False
14       0.93  NaN  b  False

In [326]:
df.drop("Bn", axis = 1, inplace=True); df # usuniƒôcie kolumny

/home/adsum/.local/lib/python3.6/site-packages/pandas/core/frame.py:4169: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

Kolumny    An  New     Cn
Wiersze
10       0.80  4.0   True
11       0.31  NaN  False
13       0.08  5.0  False
14       0.93  NaN  False

In [327]:
df.loc[20] = [3, "z", 22] # dodanie wiersza

In [328]:
df

Kolumny    An  New  Cn
Wiersze
10       0.80    4   1
11       0.31  NaN   0
13       0.08    5   0
14       0.93  NaN   0
20       3.00    z  22

In [329]:
df = df.where(df.An > 0.5).dropna()

In [330]:
df

Kolumny   An New    Cn
Wiersze
10       0.8   4   1.0
20       3.0   z  22.0

In [338]:
df.filter(items=["Cn"])

Kolumny    Cn
Wiersze
10        1.0
20       22.0

In [297]:
df.iloc[0] # wybiera elementy na podstawie kolejnosci ich wystepowania

Kolumny
An     NaN
New      4
Cn       1
Name: 10, dtype: object

In [298]:
df.loc[20] # wybiera elementy na podstawie ich etykiet

Kolumny
An      3
New     z
Cn     22
Name: 20, dtype: object

In [198]:
# CiƒÖg moment√≥w czasowych
pd.Series(pd.date_range("2019-05-20",periods=5))

0   2019-05-20
1   2019-05-21
2   2019-05-22
3   2019-05-23
4   2019-05-24
dtype: datetime64[ns]

In [199]:
pd.Series(pd.date_range("2019-05-20 00:00:00",periods=10,freq="1H"))

0   2019-05-20 00:00:00
1   2019-05-20 01:00:00
2   2019-05-20 02:00:00
3   2019-05-20 03:00:00
4   2019-05-20 04:00:00
5   2019-05-20 05:00:00
6   2019-05-20 06:00:00
7   2019-05-20 07:00:00
8   2019-05-20 08:00:00
9   2019-05-20 09:00:00
dtype: datetime64[ns]

In [200]:
df1 = pd.DataFrame(np.round(np.linspace(0,10,20),2).reshape(5,4), columns = ["a","b","c","d"]);df1

      a     b     c      d
0  0.00  0.53  1.05   1.58
1  2.11  2.63  3.16   3.68
2  4.21  4.74  5.26   5.79
3  6.32  6.84  7.37   7.89
4  8.42  8.95  9.47  10.00

In [201]:
pd.cut(df1.a,np.r_[2,4,6,8])          # podzial zbioru na klasy

0           NaN
1    (2.0, 4.0]
2    (4.0, 6.0]
3    (6.0, 8.0]
4           NaN
Name: a, dtype: category
Categories (3, interval[int64]): [(2, 4] < (4, 6] < (6, 8]]

In [202]:
pd.cut(df1.a,4)                       # podzial na 5 klas

0    (-0.00842, 2.105]
1        (2.105, 4.21]
2        (2.105, 4.21]
3        (6.315, 8.42]
4        (6.315, 8.42]
Name: a, dtype: category
Categories (4, interval[float64]): [(-0.00842, 2.105] < (2.105, 4.21] < (4.21, 6.315] < (6.315, 8.42]]

In [203]:
# Etykiety hierarchiczne
df2 = pd.DataFrame({"A":np.random.beta(1,2,10)})
df2.index = pd.MultiIndex(levels = [["a","b","c"],[1,2,3,4,5]],\
codes = [[0,0,0,0,0,1,1,2,1,2],\
[0,0,0,1,2,2,2,3,3,4]], names = ["lev1","lev2"])

In [204]:
df2

                  A
lev1 lev2
a    1     0.485417
     1     0.799898
     1     0.071106
     2     0.546629
     3     0.461124
b    3     0.153027
     3     0.786758
c    4     0.590371
b    4     0.218878
c    5     0.349165

In [205]:
# wymieszaj indeks
df3 = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)    
df3.index = i; df3

5    0.88
6    0.99
8    0.72
3    0.19
7    0.93
4    0.50
9    0.27
2    0.90
1    0.61
0    0.80
dtype: float64

In [206]:
pd.read_csv("iris.data")

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [207]:
col_names = ["sl", "sw", "pl", "pw", "class"]
df = pd.read_csv("iris.data", names=col_names)
df

      sl   sw   pl   pw           class
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [208]:
### zapis/przyklad: df.to_csv("filename.csv", index=False)

podglƒÖd danych

In [209]:
df.head()

    sl   sw   pl   pw        class
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [66]:
df.tail()

      sl   sw   pl   pw           class
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [67]:
df.sample(3, random_state=123)

      sl   sw   pl   pw            class
72   6.3  2.5  4.9  1.5  Iris-versicolor
112  6.8  3.0  5.5  2.1   Iris-virginica
132  6.4  2.8  5.6  2.2   Iris-virginica

Operacje na stringach

In [8]:
df["class"] = df["class"].str.replace("Iris-", "")

In [9]:
df

      sl   sw   pl   pw      class
0    5.1  3.5  1.4  0.2     setosa
1    4.9  3.0  1.4  0.2     setosa
2    4.7  3.2  1.3  0.2     setosa
3    4.6  3.1  1.5  0.2     setosa
4    5.0  3.6  1.4  0.2     setosa
..   ...  ...  ...  ...        ...
145  6.7  3.0  5.2  2.3  virginica
146  6.3  2.5  5.0  1.9  virginica
147  6.5  3.0  5.2  2.0  virginica
148  6.2  3.4  5.4  2.3  virginica
149  5.9  3.0  5.1  1.8  virginica

[150 rows x 5 columns]

In [10]:
df.drop(columns="pw", inplace=True)

In [11]:
df

      sl   sw   pl      class
0    5.1  3.5  1.4     setosa
1    4.9  3.0  1.4     setosa
2    4.7  3.2  1.3     setosa
3    4.6  3.1  1.5     setosa
4    5.0  3.6  1.4     setosa
..   ...  ...  ...        ...
145  6.7  3.0  5.2  virginica
146  6.3  2.5  5.0  virginica
147  6.5  3.0  5.2  virginica
148  6.2  3.4  5.4  virginica
149  5.9  3.0  5.1  virginica

[150 rows x 4 columns]

odwolywanie sie do wiekszej ilosci kolumn

In [12]:
df[["sl", "pl"]]

      sl   pl
0    5.1  1.4
1    4.9  1.4
2    4.7  1.3
3    4.6  1.5
4    5.0  1.4
..   ...  ...
145  6.7  5.2
146  6.3  5.0
147  6.5  5.2
148  6.2  5.4
149  5.9  5.1

[150 rows x 2 columns]

operacje artytmetyczne - przyklad

In [13]:
df[["sl", "pl"]] * 2

       sl    pl
0    10.2   2.8
1     9.8   2.8
2     9.4   2.6
3     9.2   3.0
4    10.0   2.8
..    ...   ...
145  13.4  10.4
146  12.6  10.0
147  13.0  10.4
148  12.4  10.8
149  11.8  10.2

[150 rows x 2 columns]

typy

In [14]:
df.dtypes

sl       float64
sw       float64
pl       float64
class     object
dtype: object

numpy + pandas - przyklad: oblicznie logarytmu

In [15]:
import numpy as np

In [16]:
np.log(df[["sl", "pl"]])

           sl        pl
0    1.629241  0.336472
1    1.589235  0.336472
2    1.547563  0.262364
3    1.526056  0.405465
4    1.609438  0.336472
..        ...       ...
145  1.902108  1.648659
146  1.840550  1.609438
147  1.871802  1.648659
148  1.824549  1.686399
149  1.774952  1.629241

[150 rows x 2 columns]

In [18]:
df.values[:5]

array([[5.1, 3.5, 1.4, 'setosa'],
       [4.9, 3.0, 1.4, 'setosa'],
       [4.7, 3.2, 1.3, 'setosa'],
       [4.6, 3.1, 1.5, 'setosa'],
       [5.0, 3.6, 1.4, 'setosa']], dtype=object)

In [19]:
df.values.shape

(150, 4)

In [20]:
df.values.dtype # object

dtype('O')

wykorzystanie funkcji generujƒÖcych dane do stworzenia nowej kolomny

In [21]:
df["new"] = np.linspace(1, 2, 150)

In [22]:
df

      sl   sw   pl      class       new
0    5.1  3.5  1.4     setosa  1.000000
1    4.9  3.0  1.4     setosa  1.006711
2    4.7  3.2  1.3     setosa  1.013423
3    4.6  3.1  1.5     setosa  1.020134
4    5.0  3.6  1.4     setosa  1.026846
..   ...  ...  ...        ...       ...
145  6.7  3.0  5.2  virginica  1.973154
146  6.3  2.5  5.0  virginica  1.979866
147  6.5  3.0  5.2  virginica  1.986577
148  6.2  3.4  5.4  virginica  1.993289
149  5.9  3.0  5.1  virginica  2.000000

[150 rows x 5 columns]

In [210]:
pd.DataFrame(np.ones((2, 3)), columns=["W", "E", "R"])

     W    E    R
0  1.0  1.0  1.0
1  1.0  1.0  1.0

grupowanie

In [211]:
df.groupby("class").mean()

                    sl     sw     pl     pw
class
Iris-setosa      5.006  3.418  1.464  0.244
Iris-versicolor  5.936  2.770  4.260  1.326
Iris-virginica   6.588  2.974  5.552  2.026

In [212]:
df.groupby("class")["sl"].mean()

class
Iris-setosa        5.006
Iris-versicolor    5.936
Iris-virginica     6.588
Name: sl, dtype: float64

In [213]:
df.groupby("class").count()

                 sl  sw  pl  pw
class
Iris-setosa      50  50  50  50
Iris-versicolor  50  50  50  50
Iris-virginica   50  50  50  50

In [214]:
df.groupby("class")["class"].count()

class
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: class, dtype: int64

apply

In [215]:
df["class"].apply(lambda x: x.upper())

0         IRIS-SETOSA
1         IRIS-SETOSA
2         IRIS-SETOSA
3         IRIS-SETOSA
4         IRIS-SETOSA
            ...
145    IRIS-VIRGINICA
146    IRIS-VIRGINICA
147    IRIS-VIRGINICA
148    IRIS-VIRGINICA
149    IRIS-VIRGINICA
Name: class, Length: 150, dtype: object

In [216]:
df["class"].str.upper()

0         IRIS-SETOSA
1         IRIS-SETOSA
2         IRIS-SETOSA
3         IRIS-SETOSA
4         IRIS-SETOSA
            ...
145    IRIS-VIRGINICA
146    IRIS-VIRGINICA
147    IRIS-VIRGINICA
148    IRIS-VIRGINICA
149    IRIS-VIRGINICA
Name: class, Length: 150, dtype: object

In [218]:
df["class"].apply(lambda x: sum([ord(y) for y in x]))

0      1107
1      1107
2      1107
3      1107
4      1107
       ...
145    1408
146    1408
147    1408
148    1408
149    1408
Name: class, Length: 150, dtype: int64

In [220]:
df["class"].str.len() # policz znaki

0      11
1      11
2      11
3      11
4      11
       ..
145    14
146    14
147    14
148    14
149    14
Name: class, Length: 150, dtype: int64

In [221]:
df.columns

Index(['sl', 'sw', 'pl', 'pw', 'class'], dtype='object')

In [222]:
df.columns.str.upper()

Index(['SL', 'SW', 'PL', 'PW', 'CLASS'], dtype='object')

In [224]:
import string
pd.Series(list(string.ascii_uppercase))

0     A
1     B
2     C
3     D
4     E
5     F
6     G
7     H
8     I
9     J
10    K
11    L
12    M
13    N
14    O
15    P
16    Q
17    R
18    S
19    T
20    U
21    V
22    W
23    X
24    Y
25    Z
dtype: object